lib/tasks/notary.rake

  task generate_flashcards: :environment do
    content_path = Rails.root.join("tmp", "notary_content.txt")

    unless File.exist?(content_path)
      puts "❌ Content file not found. Run: rake notary:scrape_pdf first"
      exit 1
    end

    content = File.read(content_path)
    scraper = NotaryPdfScraper.new
    flashcards = scraper.extract_flashcards(content)

    # Create or update 2024 pamphlet version
    pamphlet_version = PamphletVersion.find_or_create_by(year: 2024)

    # Clear existing cards for this version
    pamphlet_version.cards.destroy_all

    # Import flashcards
    flashcards.each do |card_data|
      Card.create!(
        pamphlet_version: pamphlet_version,
        question: card_data[:question],
        answer: card_data[:answer],
        topic: card_data[:topic]
      )
---
SELECT "pamphlet_versions".* FROM "pamphlet_versions" WHERE "pamphlet_versions"."year" = $1 LIMIT $2  [["year", 2024], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 1]]
INSERT INTO "cards" ("pamphlet_version_id", "question", "answer", "topic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"