app/controllers/dashboard_controller.rb

  def index
    @study_sessions = StudySession.order(created_at: :desc).limit(10)
    @total_cards_studied = StudySession.sum(:cards_studied)
    @total_correct = StudySession.sum(:correct_count)
---
SELECT "study_sessions".* FROM "study_sessions" ORDER BY "study_sessions"."created_at" DESC LIMIT $1  [["LIMIT", 10]]
SELECT SUM("study_sessions"."cards_studied") FROM "study_sessions"
SELECT SUM("study_sessions"."correct_count") FROM "study_sessions"