app/controllers/home_controller.rb

  def index
    @pamphlet_versions = PamphletVersion.includes(:cards).all
---
SELECT "cards".* FROM "cards" WHERE "cards"."pamphlet_version_id" = $1  [["pamphlet_version_id", 1]]
SELECT "pamphlet_versions".* FROM "pamphlet_versions"