app/controllers/study_sessions_controller.rb

  def show
    @study_session = StudySession.find(params[:id])
---
SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    pamphlet_version = PamphletVersion.find(params[:pamphlet_version_id])
    @study_session = StudySession.create!(
      study_date: Date.today,
      cards_studied: 0,
      correct_count: 0
    )

    # Store card IDs in session to track progress
    session[:card_ids] = pamphlet_version.cards.pluck(:id).shuffle
---
SELECT "pamphlet_versions".* FROM "pamphlet_versions" WHERE "pamphlet_versions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "study_sessions" ("study_date", "cards_studied", "correct_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["study_date", "2026-03-02"], ["cards_studied", 0], ["correct_count", 0], ["created_at", "2026-03-02 16:23:06.891192"], ["updated_at", "2026-03-02 16:23:06.891192"]]
SELECT "cards"."id" FROM "cards" WHERE "cards"."pamphlet_version_id" = $1  [["pamphlet_version_id", 1]]

  def answer
    @study_session = StudySession.find(params[:id])
    card = Card.find(params[:card_id])
    is_correct = params[:is_correct] == 'true'

    # Record the result
    @study_session.card_results.create!(
      card: card,
      is_correct: is_correct
    )

    # Update session stats
    @study_session.update!(
      cards_studied: @study_session.cards_studied + 1,
      correct_count: @study_session.correct_count + (is_correct ? 1 : 0)
    )
---
SELECT "study_sessions".* FROM "study_sessions" WHERE "study_sessions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "card_results" ("study_session_id", "card_id", "is_correct", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["study_session_id", 3], ["card_id", 3], ["is_correct", true], ["created_at", "2026-03-02 16:32:39.160522"], ["updated_at", "2026-03-02 16:32:39.160522"]]
UPDATE "study_sessions" SET "cards_studied" = $1, "correct_count" = $2, "updated_at" = $3 WHERE "study_sessions"."id" = $4  [["cards_studied", 1], ["correct_count", 1], ["updated_at", "2026-03-02 16:32:39.167485"], ["id", 3]]

  def next_card
    card_ids = session[:card_ids] || []
    current_index = session[:current_card_index] || 0

    return nil if current_index >= card_ids.length

    Card.find(card_ids[current_index])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]